/* 
  Errors.strings
  CleanMyMac

  Created by Vera Tkachenko on 3/2/15.
  Copyright (c) 2015 MacPaw. All rights reserved.
*/

/* Error descriptions */
"ErrorDescRemoving_GenericError" = "Failed to remove some files due to unknown reason.";
"ErrorDescRemoving_GenericSingleFileError" = "\"%@\" couldn’t be removed due to unknown reason.";
"ErrorDescRemoving_FileWasntAuthorized" = "\"%@\" couldn’t be removed, because you didn't authorize this operation.";
"ErrorDescRemoving_FileWasntAuthorizedMove" = "\"%@\" couldn’t be moved, because you didn't authorize this operation.";
"ErrorDescRemoving_CouldntRemoveWithPrivileges" = "\"%@\" couldn’t be removed due to lack of permissions.";
"ErrorDescRemoving_CouldntMoveWithPrivileges" = "\"%@\" couldn’t be moved due to lack of permissions.";
"ErrorDescRemoving_FailedToLaunchTask" = "Unable to execute task \"%@\". File doesn't seem to be executable or missing.";